# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/cask"

# Binaries
brew "git"
brew "wget"
brew "node"
brew "golang"
brew "dep"
brew "kubectl"

# also useful stuff
brew "watson"
brew "youtube-dl"

# Apps
cask "iterm2"
cask "docker"
cask "google-cloud-sdk"
cask "google-chrome"
cask "visual-studio-code"
cask "intellij-idea"
cask "atom"
cask "virtualbox"
cask "slack"
cask "signal"
cask "whatsapp"
cask "spotify"

# Quicklook plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "webpquicklook"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"
